$('#profile-setting').addClass('active');
$('#account-setting').removeClass('active');

$('#month').change(function () {
    let select_year = $('#year').val();
    let select_month = $('#month').val();
    let day = new Date(select_year, select_month, 0).getDate()
    for (let i = 1; i < day + 1; i++) {
        $('#day').append("<option value=\"" + i + "\">" + i + "</option>")
    }
})
let pro = ["北京市", "天津市", "上海市", "重庆市", "河北省", "山西省", "辽宁省", "吉林省", "黑龙江省", "江苏省", "浙江省", "安徽省", "福建省", "江西省", "山东省", "河南省", "湖北省", "湖南省", "广东省", "海南省", "四川省", "贵州省", "云南省", "陕西省", "甘肃省", "青海省", "内蒙古省", "广西省", "西藏省", "宁夏省", "新疆维吾尔自治区", "香港特别行政区", "澳门特别行政区", "台湾省", '其他'];

let city = {
    北京市: ["东城区", "西城区", "崇文区", "宣武区", "朝阳区", "海淀区", "丰台区", "石景山区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "门头沟区", "密云县", "延庆县"],
    天津市: ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "东丽区", "西青区", "北辰区", "津南区", "武清区", "宝坻区", "滨海新区", "静海县", "宁河县", "蓟县"],
    上海市: ["黄浦区", "卢湾区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "奉贤区", "崇明县"],
    重庆市: ["渝中区", "大渡口区", "江北区", "南岸区", "北碚区", "渝北区", "巴南区", "长寿区", "双桥区", "沙坪坝区", "万盛区", "万州区", "涪陵区", "黔江区", "永川区", "合川区", "江津区", "九龙坡区", "南川区", "綦江县", "潼南县", "荣昌县", "璧山县", "大足县", "铜梁县", "梁平县", "开县", "忠县", "城口县", "垫江县", "武隆县", "丰都县", "奉节县", "云阳县", "巫溪县", "巫山县", "石柱土家族自治县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县"],
    河北省: ["石家庄市", "唐山市", "秦皇岛市", "邯郸市", "邢台市", "保定市", "张家口市", "承德市", "沧州市", "廊坊市", "衡水市"],
    山西省: ["太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市", "运城市", "忻州市", "临汾市", "吕梁市"],
    辽宁省: ["沈阳市", "大连市", "鞍山市", "抚顺市", "本溪市", "丹东市", "锦州市", "营口市", "阜新市", "辽阳市", "盘锦市", "铁岭市", "朝阳市", "葫芦岛市"],
    吉林省: ["长春市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "松原市", "白城市", "延边朝鲜族自治州"],
    黑龙江省: ["哈尔滨市", "齐齐哈尔市", "鹤岗市", "双鸭山市", "鸡西市", "大庆市", "伊春市", "牡丹江市", "佳木斯市", "七台河市", "黑河市", "绥化市", "大兴安岭市"],
    江苏省: ["南京市", "苏州市", "无锡市", "常州市", "镇江市", "南通市", "泰州市", "扬州市", "盐城市", "连云港市", "徐州市", "淮安市", "宿迁市"],
    浙江省: ["杭州市", "宁波市", "温州市", "嘉兴市", "湖州市", "绍兴市", "金华市", "衢州市", "舟山市", "台州市", "丽水市"],
    安徽省: ["合肥市", "芜湖市", "蚌埠市", "淮南市", "马鞍山市", "淮北市", "铜陵市", "安庆市", "黄山市", "滁州市", "阜阳市", "宿州市", "巢湖市", "六安市", "亳州市", "池州市", "宣城市"],
    福建省: ["福州", "厦门市", "莆田市", "三明市", "泉州市", "漳州市", "南平市", "龙岩市", "宁德市"],
    江西省: ["南昌", "景德镇市", "萍乡市", "九江市", "新余市", "鹰潭市", "赣州市", "吉安市", "宜春市", "抚州市", "上饶市"],
    山东省: ["济南", "青岛市", "淄博市", "枣庄市", "东营市", "烟台市", "潍坊市", "济宁市", "泰安市", "威海市", "日照市", "莱芜市", "临沂市", "德州市", "聊城市", "滨州市", "菏泽市"],
    河南省: ["郑州", "开封市", "洛阳市", "平顶山市", "安阳市", "鹤壁市", "新乡", "焦作", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "信阳", "周口", "驻马店"],
    湖北省: ["武汉", "黄石市", "十堰市", "荆州市", "宜昌市", "襄樊市", "鄂州市", "荆门市", "孝感市", "黄冈市", "咸宁市", "随州市", "恩施市"],
    湖南省: ["长沙市", "株洲市", "湘潭市", "衡阳市", "邵阳市", "岳阳市", "常德市", "张家界市", "益阳市", "郴州市", "永州市", "怀化市", "娄底市", "湘西市"],
    广东省: ["广州市", "深圳市", "珠海市", "汕头市", "韶关市", "佛山市", "江门市", "湛江市", "茂名市", "肇庆市", "惠州市", "梅州市", "汕尾市", "河源市", "阳江市", "清远市", "东莞市", "中山市", "潮州市", "揭阳市", "云浮市"],
    海南省: ["海口市", "三亚市"],
    四川省: ["成都市", "自贡市", "攀枝花市", "泸州市", "德阳市", "绵阳市", "广元市", "遂宁市", "内江市", "乐山市", "南充市", "眉山市", "宜宾市", "广安市", "达州市", "雅安市", "巴中市", "资阳市", "阿坝市", "甘孜市", "凉山市"],
    贵州省: ["贵阳市", "六盘水市", "遵义市", "安顺市", "铜仁市", "毕节市", "黔西南市", "黔东南市", "黔南市"],
    云南省: ["昆明市", "曲靖市", "玉溪市", "保山市", "昭通市", "丽江市", "普洱市", "临沧市", "德宏市", "怒江市", "迪庆市", "大理市", "楚雄市", "红河市", "文山市", "西双版纳市"],
    陕西省: ["西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市", "延安市", "汉中市", "榆林市", "安康市", "商洛市"],
    甘肃省: ["兰州市", "嘉峪关市", "金昌市", "白银市", "天水市", "武威市", "酒泉市", "张掖市", "庆阳市", "平凉市", "定西市", "陇南市", "临夏市", "甘南市"],
    青海省: ["西宁市", "海东市", "海北市", "海南市", "黄南市", "果洛市", "玉树市", "海西市"],
    内蒙古省: ["呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市", "呼伦贝尔市", "巴彦淖尔市", "乌兰察布市", "锡林郭勒盟市", "兴安盟市", "阿拉善盟市"],
    广西省: ["南宁市", "柳州市", "桂林市", "梧州市", "北海市", "防城港市", "钦州市", "贵港市", "玉林市", "百色市", "贺州市", "河池市", "来宾市", "崇左市"],
    西藏省: ["拉萨市", "那曲市", "昌都市", "林芝市", "山南市", "日喀则市", "阿里市"],
    宁夏省: ["银川", "石嘴山", "吴忠", "固原", "中卫"],
    新疆维吾尔自治区省: ["乌鲁木齐市", "克拉玛依市", "吐鲁番市", "哈密市", "和田市", "阿克苏市", "喀什市", "克孜勒苏市", "巴音郭楞市", "昌吉市", "博尔塔拉市", "伊犁市", "塔城市", "阿勒泰市"],
    香港特别行政区: ["香港岛", "九龙东", "九龙西", "新界东", "新界西"],
    澳门特别行政区: ["澳门半岛", "离岛"],
    台湾省: ["台北市", "高雄市", "基隆市", "新竹市", "台中市", "嘉义市", "台南市"],
    其他: ['其他']
};
$(document).ready(function () {
    for (let i = 0; i < pro.length; i++) {
        let $option = $("<option>")
        $option.attr("value", pro[i]);
        $option.text(pro[i]);
        $(".province").append($option);
    }
})
$('.province').change(function () {
    let cities = city[$(this).val()];
    $(this).parent().find('.city').empty().append('<option value="请选择">请选择</option>')

    for (let j = 0; j < cities.length; j++) {
        let $option = $("<option>")
        $option.attr('value', cities[j])
        $option.text(cities[j])
        $(this).parent().find(".city").append($option)
    }
})
$('#save-btn').click(function () {
    $.ajax({
        url: '',
        type: 'post',
        data: {
            'name': $('#id_name').val(),
            'gender': $('input[type="radio"]:checked').val(),
            'born': $('#year').val() + '-' + $('#month').val() + '-' + $('#day').val(),
            'hometown': $('#ht-province').val() + $('#ht-city').val(),
            'location': $('#lc-province').val() + $('#lc-city').val(),
            'marriage': $('#id_marriage').val(),
            'position': $('#id_position').val(),
            'company': $('#id_company').val(),
            'work_situation': $('#id_work_situation').val()
        },
        success: function (args) {
            console.log(args)
        }
    })
})
